--- a/README.md
+++ b/README.md
@@ -51,24 +53,20 @@ There is also a video from the nodes2025 conference, showing release 2025.11.1:
 
 ## Architecture
 
-```plantuml
-@startuml
-skinparam defaultTextAlignment center
-
-rectangle "Frontend\n\ntypescript / react" as frontend
-rectangle "Backend\n\npython / flask" as backend
-database "LPG\n\nGraph Database" as lpg
-
-frontend <--> backend
-backend <--> lpg
-@enduml
+```mermaid
+flowchart TD
+    frontend[Frontend\n\ntypescript / react]
+    backend[Backend\n\npython / flask]
+    lpg[Graph Database\n\nneo4j]
+    frontend<-->backend
+    backend<-->lpg
 ```
 
 The editor consists of two parts:
 
